#квантили распределения 
#
n1<-1000
m1-0
sd1<-1
nr<-rnorm(n1, m1, sd1)

br=seq(min(nr)-0.5,max(nr)+0.5,length.out=20)
hist(nr, breaks=br, probability=TRUE,
     ylab="", main="  Теоретические значения плотности и
     Гистограмма смоделированных значений", col="lightblue")

points(br,dnorm(br,mean(nr),sd(nr)), type="l",lty=2)
quantile(nr, probs=c(0, 0.05, 0.1, .25,.5,.75,0.95, 1))
#         0%          5%         10%         25%         50%         75% 
#-3.45634919 -1.68072478 -1.30881011 -0.70179003 -0.01356136  0.61989884 
# 95%        100% 
#
#

qnorm(c(0, 0.05, 0.1, .25,.5,.75, 0.95 ,1),mean = m1, sd = sd1)
#[1]         -Inf -1.639800151 -1.276498089 -0.669436274  0.005053476
#[6]  0.679543226  1.649907103          Inf
