-- MySQL dump 10.16  Distrib 10.1.26-MariaDB, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: db
-- ------------------------------------------------------
-- Server version	10.1.26-MariaDB-0+deb9u1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Кадры`
--
CREATE DATABASE student;
use student;

DROP TABLE IF EXISTS `Кадры`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Кадры` (
  `КодСтудента` tinyint(4) DEFAULT NULL,
  `Фамилия` varchar(12) DEFAULT NULL,
  `Имя` varchar(9) DEFAULT NULL,
  `Отчество` varchar(14) DEFAULT NULL,
  `ДатаРождения` varchar(19) DEFAULT NULL,
  `НомУчГруппы` varchar(26) DEFAULT NULL,
  `Гражданство` varchar(10) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Кадры`
--

LOCK TABLES `Кадры` WRITE;
/*!40000 ALTER TABLE `Кадры` DISABLE KEYS */;
INSERT INTO `Кадры` VALUES (4,'Белозерцев','Александр','Сергеевич','1999-01-11 00:00:00','номер своей учебной группы','Россия'),(5,'Богородицкая','Елена','Константиновна','2001-07-21 00:00:00','номер своей учебной группы',' Китай'),(6,'Великанова','Елена','Николаевна','2002-06-15 00:00:00','номер своей учебной группы','Белоруссия'),(7,'Власова','Алла','Анатольевна','1999-05-21 00:00:00','номер своей учебной группы','Россия'),(8,'Гребенников','Павел','Васильевич','2002-04-17 00:00:00','номер своей учебной группы',' Китай'),(9,'Захаров','Максим','Михайлович','2003-01-15 00:00:00','номер своей учебной группы','Белоруссия'),(10,'Калинкин','Андрей','Николаевич','2000-07-23 00:00:00','номер своей учебной группы',' Китай'),(11,'Кузнецов','Николай','Николаевич','2003-09-19 00:00:00','номер своей учебной группы',' Китай'),(12,'Куприенко','Нина','Алексеевна','2004-08-18 00:00:00','номер своей учебной группы','Белоруссия'),(13,'Лаврова','Людмила','Владимировна','2002-07-27 00:00:00','номер своей учебной группы',' Китай'),(14,'Минаева','Маргарита','Евгеньевна','2004-06-23 00:00:00','номер своей учебной группы','Россия'),(15,'Менкин','Антон','Алексеевич','2003-03-12 00:00:00','номер своей учебной группы',' Китай'),(16,'Николаенко','Татьяна','Владимировна','2003-05-21 00:00:00','номер своей учебной группы','Россия'),(17,'Нишнев','Владимир','Иванович','2001-01-30 00:00:00','номер своей учебной группы',' Китай'),(18,'Палагина','Людмила','Юрьевна','2000-04-29 00:00:00','номер своей учебной группы',' Китай'),(19,'Пчелинцев','Андрей','Сергеевич','2000-05-30 00:00:00','номер своей учебной группы','Россия'),(20,'Романова','Людмила','Александровна','2001-03-30 00:00:00','номер своей учебной группы','Россия'),(21,'Русанова','Татьяна','Олеговна','2003-04-20 00:00:00','номер своей учебной группы',' Китай'),(22,'Штерн','Георгий','Борисович','2004-05-11 00:00:00','номер своей учебной группы','Россия'),(23,'Нишнев','Андрей','Иванович','1997-03-21 00:00:00','номер своей учебной группы','Россия'),(24,'Николаенко','Людмила','Олеговна','1998-08-21 00:00:00','номер своей учебной группы','Россия'),(25,'Менкин','Владимир','Алексеевич','1999-08-29 00:00:00','номер своей учебной группы','Белоруссия'),(26,'Лаврова','Нина','Алексеевна','1996-04-30 00:00:00','номер своей учебной группы','Россия'),(3,'Мария','Татьяна','Владимировна','2003-08-23 00:00:00','номер своей учебной группы','Россия'),(2,'Александр','Иванов','Сергеевич','2000-01-12 00:00:00','номер своей учебной группы',' Китай');
/*!40000 ALTER TABLE `Кадры` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Учебный план`
--

DROP TABLE IF EXISTS `Учебный план`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Учебный план` (
  `КодДисциплин` tinyint(4) DEFAULT NULL,
  `Наименование` varchar(12) DEFAULT NULL,
  `Преподаватель` varchar(10) DEFAULT NULL,
  `КолЧасов` smallint(6) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Учебный план`
--

LOCK TABLES `Учебный план` WRITE;
/*!40000 ALTER TABLE `Учебный план` DISABLE KEYS */;
INSERT INTO `Учебный план` VALUES (1,'русский язык','Александр',100),(2,'математика','Павел',200),(3,'алгебра','Андрей',80),(4,'физика','Нина',70),(5,'химия','Мария',40),(6,'физика','Белозерцев',90),(7,'русский язык','Павел',20),(8,'алгебра','Андрей',80),(9,'химия','Мария',80),(10,'физика','Белозерцев',10);
/*!40000 ALTER TABLE `Учебный план` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Электронный журнал`
--

DROP TABLE IF EXISTS `Электронный журнал`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `Электронный журнал` (
  `Код` tinyint(4) DEFAULT NULL,
  `Дата` varchar(19) DEFAULT NULL,
  `Студент` tinyint(4) DEFAULT NULL,
  `Дисциплина` varchar(3) DEFAULT NULL,
  `ВидЗанятия` varchar(16) DEFAULT NULL,
  `Оценка` tinyint(4) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Электронный журнал`
--

LOCK TABLES `Электронный журнал` WRITE;
/*!40000 ALTER TABLE `Электронный журнал` DISABLE KEYS */;
INSERT INTO `Электронный журнал` VALUES (2,'2021-01-09 00:00:00',2,'3','Лабораторная',5),(3,'2021-01-09 00:00:00',3,'1','Практика;Семинар',2),(4,'2021-01-17 00:00:00',4,'5','Практика',4),(5,'2021-01-17 00:00:00',7,'4','Практика',5),(6,'2021-01-17 00:00:00',8,'3','Практика',4),(7,'2021-01-17 00:00:00',15,'1','Практика',5),(8,'2021-01-17 00:00:00',13,'7;8','Практика',3),(9,'2021-01-17 00:00:00',3,'4','Практика',5),(10,'2021-01-17 00:00:00',15,'10','Лекция;Практика',2),(11,'2021-01-17 00:00:00',6,'5','Практика',4),(12,'2021-01-17 00:00:00',4,'2','Практика',4),(13,'2021-01-17 00:00:00',3,'4','Практика',3),(14,'2021-01-17 00:00:00',5,'6','Практика',5),(15,'2021-01-17 00:00:00',12,'2','Практика',2),(16,'2021-01-17 00:00:00',15,'5','Практика',4),(17,'2021-01-17 00:00:00',19,'8','Практика',5),(18,'2021-01-17 00:00:00',4,'6','Практика',5),(19,'2021-01-17 00:00:00',2,'1','Практика',4),(20,'2021-01-17 00:00:00',7,'2','Практика',4),(21,'2021-01-17 00:00:00',22,'8','Практика',3),(22,'2021-01-17 00:00:00',16,'4','Практика',3),(23,'2021-01-17 00:00:00',5,'8','Практика',5),(24,'2021-01-17 00:00:00',13,'4','Практика',2),(25,'2021-01-17 00:00:00',14,'2','Практика',5),(26,'2021-01-17 00:00:00',17,'1','Практика',4);
/*!40000 ALTER TABLE `Электронный журнал` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-08-22 15:20:25
