# Генерация доходности
prc_yld <- seq(0.02, 0.4, length.out=40)

# Преобразование prc_yld -> data frame
prc_yld <- data.frame(prc_yld)

# Вычислим справедливую цену облигации
for (i in 1:nrow(prc_yld)) {
  prc_yld$price[i] <- bondprc(100, 0.10, 20, prc_yld$prc_yld[i])  
}
print(prc_yld$price)
##  [1] 230.81147 204.14232 181.54196 162.31105 145.87968 131.78204 119.63629
##  [8] 109.12855 100.00000  92.03667  85.06111  78.92575  73.50748  68.70334
## [15]  64.42695  60.60563  57.17803  54.09224  51.30420  48.77640  46.47681
## [22]  44.37799  42.45640  40.69175  39.06651  37.56550  36.17551  34.88507
## [29]  33.68412  32.56386  31.51656  30.53540  29.61436  28.74811  27.93191
## [36]  27.16154  26.43322  25.74360  25.08964
# Plot P/YTM relationship
plot(prc_yld, prc_yld$price,
     type = "l",
     col = "blue",
     main = "Price/YTM Relationship")
   
